; domain
(define (domain lost-artifact)
  (:requirements :strips :typing)
  (:types location item character)

  (:predicates
    (at ?a - character ?l - location)
    (has ?a - character ?i - item)
    (sandstorm-active)
    (guardian-awake)
    (guardian-dormant)
    (rival-armed)
    (rival-unarmed)
    (artifact-retrieved)
    (map-intact)
    (accessible ?from - location ?to - location)
    (artifact-location ?l - location)
  )

  (:action travel
    :parameters (?a - character ?from - location ?to - location)
    :precondition (and 
      (at ?a ?from)
      (accessible ?from ?to)
      (not (sandstorm-active))
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?to)
    )
  )

  (:action activate-sandstorm
    :parameters ()
    :precondition ()
    :effect (sandstorm-active)
  )

  (:action retrieve-artifact
    :parameters (?a - character ?i - item ?l - location)
    :precondition (and 
      (at ?a ?l)
      (artifact-location ?l)
      (not (guardian-awake))
    )
    :effect (and
      (has ?a ?i)
      (artifact-retrieved)
    )
  )

  (:action awaken-guardian
    :parameters ()
    :precondition ()
    :effect (and
      (guardian-awake)
      (not (guardian-dormant))
    )
  )

  (:action disarm-rival
    :parameters (?a - character ?r - character ?l - location)
    :precondition (and
      (at ?a ?l)
      (at ?r ?l)
      (rival-armed)
    )
    :effect (and
      (rival-unarmed)
      (not (rival-armed))
    )
  )

  (:action steal-map
    :parameters (?r - character ?a - character ?i - item ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?a ?l)
      (has ?a ?i)
      (rival-unarmed)
    )
    :effect (and
      (not (has ?a ?i))
      (not (map-intact))
    )
  )

  (:action escape-desert
    :parameters (?a - character ?i - item ?l - location)
    :precondition (and
      (has ?a ?i)
      (at ?a ?l)
    )
    :effect ()
  )
)

; problem
(define (problem lost-artifact-problem)
  (:domain lost-artifact)

  (:objects
    arya kharun - character
    oasisvillage caravancamp ruins dunes - location
    mapfragmenta jeweledscarab - item
  )

  (:init
    (at arya oasisvillage)
    (has arya mapfragmenta)
    (map-intact)
    (at kharun caravancamp)
    (rival-unarmed)
    (guardian-dormant)
    (not (sandstorm-active))
    (artifact-location ruins)

    (accessible oasisvillage dunes)
    (accessible dunes oasisvillage)

    (accessible dunes ruins)
    (accessible ruins dunes)

    (accessible dunes caravancamp)
    (accessible caravancamp dunes)
  )

  (:goal (and
    (has arya jeweledscarab)
    (at arya oasisvillage)
  ))
)

; plan
1. (travel arya oasisvillage dunes)
   deleted: (at arya oasisvillage)
   added: (at arya dunes)
   goals met: 0 of 2
2. (travel arya dunes ruins)
   deleted: (at arya dunes)
   added: (at arya ruins)
   goals met: 0 of 2
3. (retrieve-artifact arya jeweledscarab ruins)
   added: (has arya jeweledscarab) (artifact-retrieved)
   goals met: 1 of 2
4. (travel arya ruins dunes)
   deleted: (at arya ruins)
   added: (at arya dunes)
   goals met: 1 of 2
5. (travel arya dunes oasisvillage)
   deleted: (at arya dunes)
   added: (at arya oasisvillage)
   goals met: 2 of 2
